# [ Excel => DF 저장 다루기]

## <hr>(1) 모듈 로딩

In [7]:
import pandas as pd

## <hr>(2) 데이터 준비

In [8]:
file1 = "../DATA/Single Worksheet.xlsx"
file2 = "../DATA/Multiple Worksheets.xlsx"

## <hr>(3) EXCEL => DF로 저장하기

In [9]:
pd.read_excel(file1)

  First Name Last Name           City Gender
0    Brandon     James          Miami      M
1       Sean   Hawkins         Denver      M
2       Judy       Day    Los Angeles      F
3     Ashley      Ruiz  San Francisco      F
4  Stephanie     Gomez       Portland      F

In [16]:
pd.read_excel(file2,index_col=1, sheet_name = 1) # 파일에 sheet가 3개면 0, 1, 2 순임

          First Name           City Gender
Last Name
Power         Parker        Raleigh      F
Prescott     Preston   Philadelphia      F
Donaldo      Ronaldo         Bangor      M
Stiller        Megan  San Francisco      M
Jieber        Bustin         Austin      F

In [13]:
pd.read_excel(file2,index_col=1, sheet_name = 0)

          First Name           City Gender
Last Name
James        Brandon          Miami      M
Hawkins         Sean         Denver      M
Day             Judy    Los Angeles      F
Ruiz          Ashley  San Francisco      F
Gomez      Stephanie       Portland      F